In [1]:
import pandas as pd

In [10]:
xls = pd.ExcelFile('datos_ejemplo.xlsx')
print(xls.sheet_names)

['Hoja1', 'Hoja2', 'Hoja3']

In [11]:
for sheet_name in xls.sheet_names:
    df = pd.read_excel(xls, sheet_name=sheet_name)
    print(f"Contenido de la hoja: {sheet_name}")
    display(df.head())

Contenido de la hoja: Hoja1

  Nombre  Edad     Ciudad
0   Juan    28     Madrid
1    Ana    22  Barcelona
2   Luis    35   Valencia

Contenido de la hoja: Hoja2

   Producto  Cantidad  Precio
0  Manzanas        10     1.2
1  Naranjas        15     1.5
2  Plátanos         7     0.8

Contenido de la hoja: Hoja3

        Fecha  Ventas  Beneficio
0  2023-01-01     100         20
1  2023-02-01     150         30
2  2023-03-01     200         50

## Parámetros Comunes en pd.read_excel()

- *sheet_name:* Especifica la hoja a leer (puede ser nombre o índice).
- *header:* Indica la fila que contiene los nombres de las columnas (por defecto es la primera fila).
- *names:* Lista de nombres de columnas si el archivo no tiene encabezado.
- *skiprows:* Número de filas a omitir al comienzo del archivo.
- *nrows:* Número de filas a leer desde el archivo.
- *usecols:* Especifica las columnas a leer.

In [12]:
df = pd.read_excel('datos_ejemplo.xlsx', sheet_name='Hoja1', usecols="A:B")
display(df.head())
df = pd.read_excel('datos_ejemplo.xlsx', sheet_name='Hoja1')
display(df.head())

  Nombre  Edad
0   Juan    28
1    Ana    22
2   Luis    35

  Nombre  Edad     Ciudad
0   Juan    28     Madrid
1    Ana    22  Barcelona
2   Luis    35   Valencia

In [13]:
data = {
    'Nombre': ['Juan', 'Ana', 'Luis', 'María'],
    'Edad': [28, 22, 35, 29],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla']
}
df = pd.DataFrame(data)
display(df.head())

  Nombre  Edad     Ciudad
0   Juan    28     Madrid
1    Ana    22  Barcelona
2   Luis    35   Valencia
3  María    29    Sevilla

In [14]:
df.to_excel('dataframe_ejemplo.xlsx', index=False)